Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་དབང་པོ་དང་སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པར་འདུ་ཤེས་པ་དང་། འཕགས་པའི་བདེན་པ་དང་བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་སུ་འདུ་ཤེས་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་སུ་འདུ་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་སུ་འདུ་ཤེས་པ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དུ་འདུ་ཤེས་པ་དང་། སངས་རྒྱས་བཅོམ་ལྡན་འདས་སུ་འདུ་ཤེས་པར་གྱུར་ཏེ། སངས་རྒྱས་ལ་བསྐྱེད་པའི་དགེ་བ་དག་དུ་འདུ་ཤེས་ནས། དགེ་བའི་རྩ་བ་དེ་དག་མངོན་པར་བསྡུས་ཏེ་གཅིག་ཏུ་བརྟུལ་ནས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་ཞིང་།
en: The venerable Subhūti replied to Śakra, mighty lord of the gods, “Kauśika, when noble sons or noble daughters who follow the vehicle of the bodhisattvas perceive thoughts; perceive the perfection of generosity; perceive the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom; and when they perceive the emptiness of internal phenomena, perceive the emptiness of external phenomena, perceive the emptiness of external and internal phenomena, and perceive [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities; when they perceive the four applications of mindfulness, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path; when they perceive the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, and the formless absorptions; when they perceive the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, and the extrasensory powers; when they perceive the meditative stabilities and the dhāraṇī gateways; when they perceive the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, and the eighteen distinct attributes of the buddhas; when they perceive the transcendent lord buddhas; and when they perceive the virtuous actions that give rise to buddhahood, and then amassing all these roots of virtuous action, assimilate them and dedicate them to unsurpassed, complete enlightenment, while still perceiving that they are making this dedication—Kauśika, all these perceptions are indicative of the attachment that noble sons or noble daughters who follow the vehicle of the bodhisattvas might have.

source: ཡོངས་སུ་བསྔོ་བ་དེར་ཡང་འདུ་ཤེས་པ་དེ་དག་ནི། ཀཽ་ཤི་ཀ་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་རྣམས་ཀྱི་ཆགས་པ་སྟེ། ཆགས་པ་དེ་དག་ལ་ཆགས་པར་གྱུར་ན། ཆགས་པ་མེད་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པར་མི་ནུས་སོ།
en: When they are involved with such modes of attachment, they cannot practice the perfection of wisdom, which is without attachment.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་ཀཽ་ཤི་ཀ་གཟུགས་ཀྱི་རང་བཞིན་ཡོངས་སུ་བསྔོ་བར་མི་ནུས་སོ། །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའི་རང་བཞིན་ཡོངས་སུ་བསྔོ་བར་མི་ནུས་སོ།
en: If you ask why, Kauśika, they are incapable of dedicating the intrinsic nature of physical forms, and they are incapable of dedicating the intrinsic nature of feelings, perceptions, formative predispositions, and consciousness.

source: །སྐྱེ་མཆེད་དང་ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་རང་བཞིན་ཡོངས་སུ་བསྔོ་བར་མི་ནུས་སོ།
en: They are incapable of dedicating the intrinsic nature of the sense fields, the sensory elements, and the links of dependent origination.

source: །ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་ཀྱི་རང་བཞིན་ཡོངས་སུ་བསྔོ་བར་མི་ནུས་སོ།
en: They are incapable of dedicating the intrinsic nature of the perfections.

source: །སྟོང་པ་ཉིད་ཐམས་ཅད་ཀྱི་རང་བཞིན་ཡོངས་སུ་བསྔོ་བར་མི་ནུས་སོ།
en: They are incapable of dedicating the intrinsic nature of all the aspects of emptiness.

source: །བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་གྱི་རང་བཞིན་ཡོངས་སུ་བསྔོ་བར་མི་ནུས་སོ།
en: They are incapable of dedicating the intrinsic nature of the thirty-seven factors conducive to enlightenment.

source: །འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་ཀྱི་རང་བཞིན་ཡོངས་སུ་བསྔོ་བར་མི་ནུས་སོ།
en: They are incapable of dedicating the intrinsic nature of the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, and the formless absorptions.

source: །རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་སྨོན་པ་མེད་པ་དང་།
en: They are incapable of dedicating the intrinsic nature of the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, and the extrasensory powers.

source: མངོན་པར་ཤེས་པ་རྣམས་ཀྱི་རང་བཞིན་ཡོངས་སུ་བསྔོ་བར་མི་ནུས་སོ། །ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་།
en: They are incapable of dedicating the intrinsic nature of the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, {Ki.

source: སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་རང་བཞིན་ཡོངས་སུ་བསྔོ་བར་མི་ནུས་སོ།
en: II-III: 168} the kinds of exact knowledge, and the eighteen distinct qualities of the buddhas.

source: །རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་དང་། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་ཀྱི་རང་བཞིན་ཡོངས་སུ་བསྔོ་བར་མི་ནུས་སོ།
en: They are incapable of dedicating the intrinsic nature of the fruit of entering the stream to nirvāṇa, the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, arhatship, and individual enlightenment.

source: །ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རང་བཞིན་ཡོངས་སུ་བསྔོ་བར་མི་ནུས་སོ།
en: They are incapable of dedicating the intrinsic nature of knowledge of the path and of all-aspect omniscience. “

source: །ཀཽ་ཤི་ཀ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་གཞན་ཞིག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་དུ་ཡང་དག་པར་བསྟན་ཏམ། ཡང་དག་པར་བསྐུལ་ལམ། ཡང་དག་པར་སྤྲོ་བ་བསྐྱེད་དམ། ཡང་དག་པར་རབ་ཏུ་དགའ་བར་བྱས་ན་ཡང་དག་པར་རྗེས་སུ་སོང་བའི་ཡིད་ཀྱིས་གཞན་ཡང་དག་པར་བསྟན་པར་བྱའོ། །ཡང་དག་པར་བསྐུལ་བར་བྱའོ།
en: Moreover Kauśika, when bodhisattva great beings instruct others in unsurpassed, complete enlightenment, encouraging them, filling them with enthusiasm, and causing them to rejoice, they should instruct and encourage them, filling them with enthusiasm, and causing them to rejoice, with a mind that is in conformity with reality. “

source: །ཡང་དག་པར་སྤྲོ་བ་བསྐྱེད་པར་བྱའོ། །ཡང་དག་པར་དགའ་བ་བསྐྱེད་པར་བྱའོ། །དེ་ཡང་ཅི་ནས་ཀྱང་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། བདག་ནི་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ་ཞེས་བྱ་བར་རྣམ་པར་རྟོག་པར་མི་འགྱུར་བ་དང་།
en: Also, when practicing the perfection of generosity by whatever means, they will not think, ‘I am practicing the perfection of generosity.’

source: བདག་ནི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ།
en: They will not think, ‘I am practicing the perfection of ethical discipline.

source: །བདག་ནི་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ།
en: I am practicing the perfection of tolerance.

source: །བདག་ནི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ།
en: I am practicing the perfection of perseverance.

source: །བདག་ནི་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ།
en: I am practicing the perfection of meditative concentration.

source: །བདག་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ་ཞེས་བྱ་བར་རྣམ་པར་རྟོག་པར་མི་འགྱུར་བ་དང་། བདག་ནི་ནང་སྟོང་པ་ཉིད་ལ་སྤྱོད་དོ།
en: I am practicing the perfection of wisdom.’ They will not think, ‘I am practicing the emptiness of internal phenomena.

source: །བདག་ནི་ཕྱི་སྟོང་པ་ཉིད་ལ་སྤྱོད་དོ།
en: I am practicing the emptiness of external phenomena.

source: །བདག་ནི་ཕྱི་ནང་སྟོང་པ་ཉིད་ལ་སྤྱོད་དོ།
en: I am practicing the emptiness of external and internal phenomena.

source: །བདག་ནི་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ལ་སྤྱོད་དོ།
en: I am practicing [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities.

source: །བདག་ནི་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ལ་སྤྱོད་དོ།
en: I am practicing the thirty-seven factors conducive to enlightenment.

source: །བདག་ནི་འཕགས་པའི་བདེན་པ་རྣམས་ལ་སྤྱོད་དོ།
en: I am practicing the truths of the noble ones.

source: །བདག་ནི་བསམ་གཏན་དང་ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་ལ་སྤྱོད་དོ།
en: I am practicing the meditative concentrations, the immeasurable attitudes, and the formless absorptions.

source: །བདག་ནི་རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་།
en: I am practicing the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, and the extrasensory powers.

source: མངོན་པར་ཤེས་པ་རྣམས་ལ་སྤྱོད་དོ། །བདག་ནི་ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ལ་སྤྱོད་དོ།
en: I am practicing the meditative stabilities and the dhāraṇī gateways.

source: །བདག་ནི་དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ལ་སྤྱོད་དོ་ཞེས་བྱ་བར་རྣམ་པར་རྟོག་པར་མི་འགྱུར་བ་དང་།
en: I am practicing the powers of the tathāgatas, the four fearlessnesses, the kinds of exact knowledge, and the eighteen distinct qualities of the buddhas.’

source: བདག་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལ་སྤྱོད་དོ་ཞེས་བྱ་བར་རྣམ་པར་རྟོག་པར་མི་འགྱུར་བ་དེ་ལྟར་ཡང་དག་པར་བསྟན་པར་བྱ།
en: They will not think, ‘I am practicing all-aspect omniscience.’

source: ཡང་དག་པར་བསྐུལ་བར་བྱ། ཡང་དག་པར་སྤྲོ་བ་བསྐྱེད་པར་བྱ། ཡང་དག་པར་དགའ་བ་བསྐྱེད་པར་བྱ་སྟེ།
en: It is in that manner that they should instruct and encourage others, filling them with enthusiasm and causing them to rejoice.

source: དེ་ལྟར་སྤྱོད་པའི་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོས། གཞན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་བསྟན་པར་བྱའོ། །ཡང་དག་པར་བསྐུལ་པར་བྱའོ། །ཡང་དག་པར་སྤྲོ་བ་བསྐྱེད་པར་བྱའོ། །ཡང་དག་པར་དགའ་བ་བསྐྱེད་པར་བྱའོ། །དེ་ཡང་དག་པར་བསྟན་པ་དེ་དང་། ཡང་དག་པར་བསྐུལ་བ་དེ་དང་། ཡང་དག་པར་སྤྲོ་བ་བསྐྱེད་པར་བྱ་བ་དེ་དང་།
en: Noble sons or noble daughters who practice in that manner should instruct and encourage others in unsurpassed, complete enlightenment, filling them with enthusiasm and causing them to rejoice.

source: ཡང་དག་པར་དགའ་བ་བསྐྱེད་པར་བྱ་བ་དེས། གཞན་ཡང་དག་པར་སྟོན་ཅིང་ཡང་དག་པར་བསྐུལ་བ་དང་། ཡང་དག་པར་སྤྲོ་བ་སྐྱེད་ཅིང་ཡང་དག་པར་དགའ་བར་བྱེད་པའི་ཚེ། རྨ་འབྱུང་བར་མི་འགྱུར་ཞིང་། སངས་རྒྱས་ཀྱིས་གནང་བའི་ཡང་དག་པར་བསྐུལ་བས་ཡང་དག་པར་བསྐུལ་བ་ཡིན་ཏེ།
en: When those who would instruct and encourage others, filling them with enthusiasm and causing them to rejoice, actually do so, they will not degenerate [in their commitments], and this will encourage the buddhas to accept them. {

source: དེ་ལྟར་ན་རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་དེས་ཆགས་པའི་མཐའ་ཐམས་ཅད་ཡོངས་སུ་སྤངས་པ་ཡིན་ནོ།
en: Ki.II-III: 169} Noble sons or noble daughters who act in that manner will renounce all the limits of attachment.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་ལེགས་སོ་ཞེས་བྱ་བ་གནང་སྟེ།
en: Thereupon, the Blessed One addressed the venerable Subhūti: “Subhūti, well said!

source: རབ་འབྱོར་དེ་ལྟར་ཁྱོད་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་ཆགས་པའི་རྣམ་པ་དེ་ལྟ་བུ་དག་སྟོན་པ་ལེགས་སོ་ལེགས་སོ།
en: Subhūti, it is excellent that you are teaching those points concerning attachment.

source: །རབ་འབྱོར་དེ་བས་ན་ཁྱོད་ལ་ཆགས་པའི་རྣམ་པ་དེ་བས་ཀྱང་ཕྲ་བ་བསྟན་པར་བྱས།
en: Excellent! Subhūti, for this reason I will also explain to you more subtle modes of attachment than these.

source: དེ་ཤིན་དུ་ལེགས་པར་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་བསྟན་པར་བྱའོ། །བཅོམ་ལྡན་འདས་དེ་ལྟར་བགྱིའོ་ཞེས་ནས། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་བཅོམ་ལྡན་འདས་ལ་ཕྱིར་ཉན་ཏོ།
en: Listen well, be attentive, and I will teach them!” “Blessed Lord, may it be so!” he replied.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རབ་འབྱོར་འདི་ལ་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་ཞུགས་པ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མཚན་མར་ཡིད་ལ་བྱེད་ན། རབ་འབྱོར་ཇི་ཙམ་དུ་མཚན་མར་གྱུར་པ་དེ་ཙམ་དུ་ཆགས་པའོ།
en: Then the venerable Subhūti listened to the Blessed One, as the Blessed One said, “Subhūti, when noble sons or noble daughters who have entered upon unsurpassed, complete enlightenment focus their attention on the tathāgatas, arhats, completely awakened buddhas in terms of conceptual images or signs, Subhūti, to whatever extent they resort to conceptual images or signs, to that extent there would be attachment.

source: །གང་ཡང་འདས་པ་དང་། མ་བྱོན་པ་དང་། ད་ལྟར་བྱུང་བའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཆགས་པ་ཐམས་ཅད་དང་བྲལ་བ་དེ་དག་གི་ཐུགས་དང་པོ་བསྐྱེད་པ་ནས། དམ་པའི་ཆོས་གནས་པའི་བར་གྱི་དགེ་བའི་རྩ་བ་གང་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་མཚན་མར་ཡིད་ལ་བྱེད་ཅིང་། ཡིད་ལ་བྱས་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་ན།
en: When in terms of conceptual images or signs they focus their attention on all the roots of virtue possessed by past, present, and future tathāgatas, arhats, completely awakened buddhas who are free from all attachments, in the interval extending from the time when they first begin to set their mind on enlightenment until their establishing of the Dharma, and having focused their attention on them [in that manner], dedicate their merit to unsurpassed, complete enlightenment, Subhūti, to whatever extent they focus their attention on them in terms of conceptual images or signs, to that extent there would be attachment. “

source: རབ་འབྱོར་ཇི་ཙམ་དུ་མཚན་མར་ཡིད་ལ་བྱེད་པ་དེ་ཙམ་དུ་ཆགས་པའོ། །གང་ཡང་དེ་བཞིན་གཤེགས་པའི་ཉན་ཐོས་དེ་དག་དང་། དེ་མ་ཡིན་པའི་སེམས་ཅན་གཞན་རྣམས་ཀྱིས་དགེ་བའི་རྩ་བ་གང་ཇི་སྙེད་པ་དེ་ཐམས་ཅད་ཀྱང་མཚན་མར་བྱས་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་ན། རབ་འབྱོར་ཇི་ཙམ་དུ་མཚན་མར་ཡིད་ལ་བྱེད་པ་དེ་ཙམ་དུ་ཆགས་པའོ།
en: Similarly, when in terms of conceptual images or signs they focus their attention on all the roots of virtue possessed by the śrāvakas of those tathāgatas and other beings apart from them, and dedicate these to unsurpassed, complete enlightenment, Subhūti, to whatever extent they focus their attention in terms of conceptual images or signs, to that extent there would be attachment.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་བཞིན་གཤེགས་པ་དེ་དག་ནི་མཚན་མར་ཡིད་ལ་བྱ་བ་མ་ཡིན་ཏེ། དེ་བཞིན་གཤེགས་པ་དེ་དག་གི་དགེ་བའི་རྩ་བ་ཡང་མཚན་མར་ཡིད་ལ་བྱ་བ་མ་ཡིན་ནོ།
en: If you ask why, it is because they should not focus their attention on the tathāgatas in terms of conceptual images or signs, and they should not focus their attention even on the roots of virtue possessed by the tathāgatas in terms of conceptual images or signs.”

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་ཟབ་བོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Then Subhūti said, “Blessed Lord, the perfection of wisdom is profound.” “

source: རབ་འབྱོར་ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་རྣམ་པར་དབེན་པའི་ཕྱིར་རོ།
en: Subhūti, that is because all phenomena are naturally void,” replied the Blessed One. “

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ཕྱག་འཚལ་ལོ།
en: Blessed Lord, I pay homage to the perfection of wisdom!” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མ་བྱས་མངོན་པར་འདུ་མ་བྱས་པ་སྟེ།
en: Subhūti,” replied the Blessed One, “so it is that the perfection of wisdom is unfabricated and unconditioned.

source: དེ་ནི་སུས་ཀྱང་མངོན་པར་འཚང་རྒྱ་བར་བྱ་བར་མི་ནུས་སོ།
en: With regard to it, there is no one at all who can attain consummate buddhahood.” “

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་ནི་མངོན་པར་སངས་མ་རྒྱས་པའོ།
en: Blessed Lord, there are none at all who will attain consummate buddhahood.” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་ཆོས་ཀྱི་རང་བཞིན་ནི་གཉིས་མ་ཡིན་ཏེ།
en: Subhūti,” replied the Blessed One, “so it is that the nature of phenomena is without duality.

source: ཆོས་ཀྱི་རང་བཞིན་ནི་གཅིག་ཏུ་ཟད་དོ།
en: The nature of phenomena is exclusively singular. Subhūti, {Ki.

source: །རབ་འབྱོར་ཆོས་ཀྱི་རང་བཞིན་ནི་གཅིག་པོ་གང་ཡིན་པ་དེ་ནི་རང་བཞིན་མ་ཡིན་ནོ།
en: II-III: 170} this singular nature of phenomena is without inherent existence.

source: །གང་རང་བཞིན་མ་ཡིན་པ་དེ་ནི་མ་བྱས་པའོ།
en: Subhūti, that which is without inherent existence is unfabricated.

source: །གང་མ་བྱས་པ་དེ་ནི་མངོན་པར་འདུས་མ་བྱས་པའོ།
en: That which is unfabricated is unconditioned.

source: །རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས། ཆོས་ཀྱི་རང་བཞིན་གཅིག་པོ་གང་རང་བཞིན་མ་ཡིན་པ་མ་བྱས་པ་མངོན་པར་འདུས་མ་བྱས་པ་ཤེས་ན་ཆགས་པའི་རྣམ་པ་ཐམས་ཅད་ཡོངས་སུ་སྤངས་པ་ཡིན་ནོ།
en: Subhūti, so it is that when bodhisattva great beings know that the singular nature of phenomena without inherent existence is unfabricated and unconditioned, they abandon all modes of attachment.” “

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་རྟོགས་པར་དཀའ་བའོ།
en: Blessed Lord! The perfection of wisdom is hard to realize.” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་སུས་ཀྱང་མ་མཐོང་མ་རྟོགས། རྣམ་པར་མི་ཤེས་མངོན་པར་སངས་མ་རྒྱས་པའི་ཕྱིར་རོ།
en: Subhūti,” replied the Blessed One, “this is because the perfection of wisdom has not been seen, realized, cognized, or acquired in manifest buddhahood by anyone at all.” “

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་བསམ་གྱིས་མི་ཁྱབ་པའོ།
en: Blessed Lord! The perfection of wisdom is inconceivable.” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་སེམས་ཀྱིས་མ་ཤེས་སོ། །གཟུགས་དང་། ཚོར་བ་དང་། འདུ་ཤེས་དང་།
en: Subhūti,” replied the Blessed One, “this is because it has not been known by the mind, and it has not been known by physical forms, feelings, perceptions, formative predispositions, or consciousness.

source: འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ས་མ་ཤེས་སོ། སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བས་མ་ཤེས་སོ། །ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་དང་སྟོང་པ་ཉིད་རྣམས་དང་།
en: It has not been known by the sense fields, the sensory elements, or the links of dependent origination.

source: བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས། དང་འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་ཀྱིས་མ་ཤེས་སོ།
en: It has not been known by the perfections, the aspects of emptiness, the factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, or the formless absorptions.

source: །རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་མངོན་པར་ཤེས་པ་རྣམས་ཀྱིས་མ་ཤེས་སོ།
en: It has not been known by the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, or the extrasensory powers.

source: ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ཀྱིས་མ་ཤེས་སོ།
en: It has not been known by the meditative stabilities or the dhāraṇī gateways.

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱིས་མ་ཤེས་སོ།
en: It has not been known by the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, or the eighteen distinct qualities of the buddhas.

source: རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་དང་། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་ཀྱིས་མ་ཤེས་སོ།
en: It has not been known by the fruit of entering the stream to nirvāṇa, the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, arhatship, or individual enlightenment.

source: ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱིས་མ་ཤེས་སོ།
en: It has not been known by knowledge of the path or all-aspect omniscience.”

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ་ལས། ཆོས་ཐམས་ཅད་རྣམ་པར་དག་པའི་ལེའུ་སྟེ། ཉི་ཤུ་རྩ་བདུན་པའོ།། །།
en: This completes the twenty-seventh chapter, “The Purity of All the Dharmas,” from “The Perfection of Wisdom in Twenty-Five Thousand Lines.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Chapter 28 Then the venerable Subhūti said to the Blessed One, “Blessed Lord!

source: །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་བགྱིད་པ་མ་མཆིས་པའོ།
en: The perfection of wisdom is inactive.” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་བྱེད་པ་པོ་མི་དམིགས་པའི་ཕྱིར་རོ།
en: Subhūti,” replied the Blessed One, “that is because agents are nonapprehensible.

source: །རབ་འབྱོར་དེ་བཞིན་དུ་གཟུགས་མི་དམིགས་པ་དང་། ཚོར་བ་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་མི་དམིགས་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་མི་དམིགས་པའི་ཕྱིར་རོ།
en: Similarly, Subhūti, it is because physical forms are nonapprehensible, feelings, perceptions, formative predispositions, and consciousness are nonapprehensible, and [all the attributes and goals], up to and including all-aspect omniscience, are nonapprehensible.” “

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པས་རྣམ་པ་ཇི་ལྟར་སྤྱད་པར་བགྱི།
en: Blessed Lord! How then should bodhisattva great beings practice the perfection of wisdom?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། གལ་ཏེ་གཟུགས་ལ་མི་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ།
en: Subhūti,” replied the Blessed One, “in this regard, when bodhisattva great beings practice the perfection of wisdom, if they do not engage with physical forms, then they are practicing the perfection of wisdom.

source: །གལ་ཏེ་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ལ་མི་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ།
en: If they do not engage with feelings, perceptions, formative predispositions, or consciousness, then they are practicing the perfection of wisdom.

source: །གལ་ཏེ་སྐྱེ་མཆེད་དང་ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ལ་མི་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། །གལ་ཏེ་ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་།
en: If they do not engage with the sense fields, the sensory elements, or the links of dependent origination, then they are practicing the perfection of wisdom.

source: སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་ལ་མི་སྤྱོད་ན།
en: If they do not engage with any of the perfections, any of the aspects of emptiness, the thirty-seven factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, or the formless absorptions, then they are practicing the perfection of wisdom.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། །གལ་ཏེ་རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་དགུ་དང་། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་།
en: If they do not engage with the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, or the extrasensory powers, then they are practicing the perfection of wisdom.

source: མངོན་པར་ཤེས་པ་རྣམས་ལ་མི་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། །གལ་ཏེ་ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ལ་མི་སྤྱོད་ན།
en: If they do not engage with the meditative stabilities or the dhāraṇī gateways, then they are practicing the perfection of wisdom.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། །གལ་ཏེ་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ལ་མི་སྤྱོད་ན།
en: If they do not engage with the ten powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, or the eighteen distinct qualities of the buddhas, then they are practicing the perfection of wisdom.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། །གལ་ཏེ་ཐམས་ཅད་ཤེས་པ་ཉིད་དང་། ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་མི་སྤྱོད་ན།
en: If they do not engage with knowledge of all the dharmas, knowledge of the path, or all-aspect omniscience, then they are practicing the perfection of wisdom. {

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ།
en: Ki.
